{
    "AK": {
        "full_name": "Actinic Keratosis",
        "description": "Actinic Keratosis is a rough, scaly patch or bump on your skin that develops due to prolonged exposure to the sun. It is commonly found on areas such as the face, lips, ears, neck, scalp, or the back of your hands. If left untreated, it has the potential to progress to squamous cell carcinoma, a type of skin cancer.",
        "contagious": "no",
        "severity": "moderate"
    },
    "Acne": {
        "full_name": "Acne",
        "description": "Acne is a common skin condition that occurs when hair follicles become clogged with oil and dead skin cells. It manifests as pimples, blackheads, whiteheads, or cysts, primarily on the face, chest, and back. Hormonal changes, stress, and diet can contribute to its severity.",
        "contagious": "no",
        "severity": "low to moderate"
    },
    "BCC": {
        "full_name": "Basal Cell Carcinoma",
        "description": "Basal Cell Carcinoma is the most common type of skin cancer that arises from the basal cells in the epidermis. It often appears as a translucent, pearly bump, though it can also present as a flat, scaly patch. While BCC rarely spreads to other parts of the body, it can cause significant local damage if not treated promptly.",
        "contagious": "no",
        "severity": "moderate"
    },
    "DF": {
        "full_name": "Dermatofibroma",
        "description": "Dermatofibroma is a benign skin growth that often appears as a small, firm nodule on the legs, arms, or other parts of the body. It is typically harmless and may feel tender or itchy. While the exact cause is unknown, it may develop as a reaction to minor injuries, insect bites, or trauma to the skin.",
        "contagious": "no",
        "severity": "low"
    },
    "MEL": {
        "full_name": "Melanoma",
        "description": "Melanoma is the most serious form of skin cancer, originating in the pigment-producing melanocytes of the skin. It is characterized by the appearance of new or changing moles that are asymmetric, have irregular borders, or display multiple colors. Early detection and treatment are crucial to prevent the spread to other parts of the body, as advanced melanoma can be life-threatening.",
        "contagious": "no",
        "severity": "severe"
    },
    "NV": {
        "full_name": "Melanocytic Nevi",
        "description": "Melanocytic Nevi, commonly known as moles, are benign growths on the skin caused by clusters of melanocytes. They are usually brown or black and can appear anywhere on the body. While typically harmless, some moles may evolve into melanoma if they change in size, shape, or color.",
        "contagious": "no",
        "severity": "low"
    },
    "SCC": {
        "full_name": "Squamous Cell Carcinoma",
        "description": "Squamous Cell Carcinoma is the second most common form of skin cancer, arising from the squamous cells in the epidermis. It typically appears as a firm red nodule or a flat lesion with a scaly, crusted surface. SCC can occur anywhere on the body but is most commonly found on sun-exposed areas like the face, ears, neck, and hands. While it can metastasize, especially if left untreated, early detection and treatment usually result in a favorable prognosis.",
        "contagious": "no",
        "severity": "moderate"
    },
    "SEK": {
        "full_name": "Seborrheic Keratoses",
        "description": "Seborrheic Keratoses are noncancerous skin growths that appear as waxy, scaly, or slightly raised lesions. They vary in color from light tan to dark brown and are commonly found on the face, chest, shoulders, or back. While generally harmless, they can be removed for cosmetic reasons or if irritated.",
        "contagious": "no",
        "severity": "low"
    },
    "VASC": {
        "full_name": "Vascular Lesion",
        "description": "Vascular Lesions are abnormalities of blood vessels in the skin, such as hemangiomas, port-wine stains, or spider veins. They may appear as red, purple, or blue patches or spots. While most are benign, some may require medical attention if they cause discomfort or indicate an underlying condition.",
        "contagious": "no",
        "severity": "low to moderate"
    }
}
